In [1]:
import mysql.connector as conn
mydb = conn.connect(host = 'localhost', user= 'root', password = '#GDG2305gd01#')
cursor= mydb.cursor()

In [3]:
mydb

In [4]:
cursor.execute("create Database Organization")

In [6]:
cursor.execute("CREATE TABLE Organization.Worker (WORKER_ID INT(10), FIRST_NAME VARCHAR(25), LAST_NAME VARCHAR(25), SALARY INT(15), JOINING_DATE DATETIME, DEPARTMENT VARCHAR(25))")

In [7]:
cursor.execute("use Organization")

In [9]:
cursor.execute("show tables")

In [10]:
cursor.fetchall()

[('worker',)]

In [20]:
sql = "insert into Organization.Worker(WORKER_ID, FIRST_NAME, LAST_NAME , SALARY, JOINING_DATE, DEPARTMENT) VALUES (%s, %s, %s, %s, %s, %s)"
val= [
               (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
               (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
               (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
               (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
               (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
               (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
               (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
               (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')
      ]    
cursor.executemany(sql,val)
mydb.commit()

In [21]:
cursor.execute("select * from Organization.Worker")

In [22]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin'),
 (1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

In [23]:
cursor.execute("CREATE TABLE Organization.Bonus (WORKER_REF_ID INT(10), BONUS_AMOUNT INT(10),BONUS_DATE DATETIME)")

In [24]:
cursor.execute("use Organization")
cursor.execute("show tables")

In [25]:
cursor.fetchall()

[('bonus',), ('worker',)]

In [35]:
import mysql.connector as conn
mydb = conn.connect(host = 'localhost', user= 'root', password = '#GDG2305gd01#')
cursor= mydb.cursor()
sql = "insert into Organization.Bonus (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES (%s, %s, %s)"
val = [
    (1, 4000, '16-06-11'),
    (2, 4500, '16-02-20'),
    (3, 5000, '16-02-20'),
    (4, 5500, '16-02-20'),
    (5, 6000, '16-06-11')
]

cursor.executemany(sql,val)
mydb.commit

In [36]:
cursor.execute("select * from Organization.Bonus")

In [37]:
cursor.fetchall()

[(1, 4000, datetime.datetime(2016, 6, 11, 0, 0)),
 (2, 4500, datetime.datetime(2016, 2, 20, 0, 0)),
 (3, 5000, datetime.datetime(2016, 2, 20, 0, 0)),
 (4, 5500, datetime.datetime(2016, 2, 20, 0, 0)),
 (5, 6000, datetime.datetime(2016, 6, 11, 0, 0))]

In [38]:
#Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>.

cursor.execute("Select FIRST_NAME AS WORKER_NAME from Organization.Worker")
cursor.fetchall()

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',),
 ('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

In [41]:
#Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

cursor.execute("Select DISTINCT Department from Organization.Worker")
cursor.fetchall()

[('HR',), ('Admin',), ('Account',)]

In [43]:
#Write an SQL query to show the last 5 record from a table.

cursor.execute("SELECT * FROM Organization.Worker LIMIT 5 OFFSET 3")
cursor.fetchall()

[(4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]